@echo off
chcp 65001 > nul
title تشغيل متجر عطور بَـرْق أونلاين عبر الإنترنت ⚡
color 0B

echo ======================================================================
echo           ⚡ تشغيل متجر عطور بَـرْق أونلاين على الإنترنت (BARQ) ⚡
echo ======================================================================
echo.
echo  [1] جاري تشغيل سيرفر المتجر المحلي...
start /B python server.py
echo.
echo  [2] جاري إنشاء رابط إنترنت عام مشفر مجاناً عبر Cloudflare...
echo.

cloudflared.exe tunnel --url http://localhost:8000

pause
